; domain
(define (domain blocks)
  (:requirements :adl)
  (:predicates
    (hand-empty)
    (holding ?x)
    (on-top ?x ?y) 
    (on-floor ?x)   
    (clear ?x)     
  )
  
  (:action podnies-z-paczki
    :parameters (?x ?y)
    :precondition (and (on-top ?x ?y) (clear ?x) (hand-empty))
    :effect (and (holding ?x) (clear ?y) (not (on-top ?x ?y)) (not(hand-empty)) )
  )

  (:action podnies-z-podlogi
    :parameters (?x)
    :precondition (and (on-floor ?x) (clear ?x) (hand-empty))
    :effect (and (holding ?x) (not (on-floor ?x)) (not (hand-empty)) )
  )

  (:action opusc-na-podloge
    :parameters (?x)
    :precondition (holding ?x)
    :effect (and (on-floor ?x) (clear ?x) (hand-empty) (not(holding ?x)) )
  )

  (:action opusc-na-paczke
    :parameters (?y ?x)
    :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)) )
    :effect (and (on-top ?x ?y) (clear ?x) (hand-empty) (not (holding ?x)) (not (clear ?y)))
  )
)

; problem
(define (problem p1)
    (:domain blocks)
    (:objects
        a b c d e
    )
    (:init
        (clear c)
        (on-top c b)
        (on-top b a)
        (on-floor a)
        (clear e)
        (on-top e d)
        (on-floor d)
        (hand-empty)
    )
    (:goal (forall (?x) (on-floor ?x)))
)

; plan
1. (podnies-z-paczki e d)
   deleted: (on-top e d) (hand-empty)
   added: (holding e) (clear d)
   goals met: 0 of 1
2. (opusc-na-podloge e)
   deleted: (holding e)
   added: (on-floor e) (hand-empty)
   goals met: 0 of 1
3. (podnies-z-paczki c b)
   deleted: (on-top c b) (hand-empty)
   added: (holding c) (clear b)
   goals met: 0 of 1
4. (opusc-na-podloge c)
   deleted: (holding c)
   added: (on-floor c) (hand-empty)
   goals met: 0 of 1
5. (podnies-z-paczki b a)
   deleted: (on-top b a) (hand-empty)
   added: (holding b) (clear a)
   goals met: 0 of 1
6. (opusc-na-podloge b)
   deleted: (holding b)
   added: (on-floor b) (hand-empty)
   goals met: 1 of 1
